(function($){
    $.fn.validationEngineLanguage = function(){
    };
    $.validationEngineLanguage = {
        newLang: function(){
            $.validationEngineLanguage.allRules = {
                "required": { // Добавете вашите regex правила тук, можете да вземете телефон като пример
                    "regex": "none",
                    "alertText": "* Това поле е задължително",
                    "alertTextCheckboxMultiple": "* Моля, изберете опция",
                    "alertTextCheckboxe": "* Тази отметка е задължителна",
                    "alertTextDateRange": "* И двете полета за дата са задължителни"
                },
                "requiredInFunction": { 
                    "func": function(field, rules, i, options){
                        return (field.val() == "test") ? true : false;
                    },
                    "alertText": "* Полето трябва да съдържа \"test\""
                },
                "dateRange": {
                    "regex": "none",
                    "alertText": "* Невалидна ", 
                    "alertText2": "Дата"
                },
                "dateTimeRange": {
                    "regex": "none",
                    "alertText": "* Невалидна ",
                    "alertText2": "Дата и час"
                },
                "minSize": {
                    "regex": "none",
                    "alertText": "* Минимум ",
                    "alertText2": " символи"
                },
                "maxSize": {
                    "regex": "none",
                    "alertText": "* Максимум ",
                    "alertText2": " символи"
                },
                "groupRequired": {
                    "regex": "none",
                    "alertText": "* Трябва да попълните едно от следните полета",
                    "alertTextCheckboxMultiple": "* Моля, изберете опция",
                    "alertTextCheckboxe": "* Тази отметка е задължителна"
                },
                "min": {
                    "regex": "none",
                    "alertText": "* Минималната стойност е "
                },
                "max": {
                    "regex": "none",
                    "alertText": "* Максималната стойност е "
                },
                "past": {
                    "regex": "none",
                    "alertText": "* Датата трябва да е преди "
                },
                "future": {
                    "regex": "none",
                    "alertText": "* Датата трябва да е след "
                },	
                "maxCheckbox": {
                    "regex": "none",
                    "alertText": "* Максимум ",
                    "alertText2": " опции позволени"
                },
                "minCheckbox": {
                    "regex": "none",
                    "alertText": "* Моля, изберете ",
                    "alertText2": " опции"
                },
                "equals": {
                    "regex": "none",
                    "alertText": "* Полетата не съвпадат"
                },
                "creditCard": {
                    "regex": "none",
                    "alertText": "* Невалиден номер на кредитна карта"
                },
                "phone": {
                    // кредит: jquery.h5validate.js / orefalo
                    "regex": /^([\+][0-9]{1,3}([ \.\-])?)?([\(][0-9]{1,6}[\)])?([0-9 \.\-]{1,32})(([A-Za-z \:]{1,11})?[0-9]{1,4}?)$/,
                    "alertText": "* Невалиден телефонен номер"
                },
                "email": {
                    // HTML5 съвместим regex за имейл (http://www.whatwg.org/specs/web-apps/current-work/multipage/states-of-the-type-attribute.html#e-mail-state-%28type=email%29)
                    "regex": /^(([^<>()[\]\\.,;:\s@\"]+(\.[^<>()[\]\\.,;:\s@\"]+)*)|(\".+\"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
                    "alertText": "* Невалиден имейл адрес"
                },
                "fullname": {
                    "regex": /^([a-zA-Zа-яА-Я]+[\'\,\.\-]?[a-zA-Zа-яА-Я ]*)+[ ]([a-zA-Zа-яА-Я]+[\'\,\.\-]?[a-zA-Zа-яА-Я ]+)+$/,
                    "alertText":"* Трябва да съдържа име и фамилия"
                },
                "zip": {
                    "regex": /^\d{5}$|^\d{5}-\d{4}$/,
                    "alertText":"* Невалиден формат на пощенски код"
                },
                "integer": {
                    "regex": /^[\-\+]?\d+$/,
                    "alertText": "* Невалидно цяло число"
                },
                "number": {
                    // Number, включително положителни, отрицателни и дробни числа. кредит: orefalo
                    "regex": /^[\-\+]?((([0-9]{1,3})([,][0-9]{3})*)|([0-9]+))?([\.]([0-9]+))?$/,
                    "alertText": "* Невалидно число"
                },
                "date": {                    
                    // Проверка дали датата е валидна, като се взема предвид високосната година
                    "func": function (field) {
                        var pattern = new RegExp(/^(\d{4})[\/\-\.](0?[1-9]|1[012])[\/\-\.](0?[1-9]|[12][0-9]|3[01])$/);
                        var match = pattern.exec(field.val());
                        if (match == null)
                           return false;
    
                        var year = match[1];
                        var month = match[2]*1;
                        var day = match[3]*1;					
                        var date = new Date(year, month - 1, day); // защото месеците започват от 0.
    
                        return (date.getFullYear() == year && date.getMonth() == (month - 1) && date.getDate() == day);
                    },                		
                    "alertText": "* Невалидна дата, трябва да е във формат ГГГГ-ММ-ДД"
                },
                "ipv4": {
                    "regex": /^((([01]?[0-9]{1,2})|(2[0-4][0-9])|(25[0-5]))[.]){3}(([0-1]?[0-9]{1,2})|(2[0-4][0-9])|(25[0-5]))$/,
                    "alertText": "* Невалиден IP адрес"
                },
                "url": {
                    "regex": /^(https?|ftp):\/\/(((([a-zA-Zа-яА-Я\d\-._~!$&'()*+,;=:@%]+)@)?((\d{1,3}\.){3}\d{1,3})|(([a-zA-Zа-яА-Я\d\-._~!$&'()*+,;=:@%]+\.)+[a-zA-Zа-яА-Я]{2,})))?(:\d+)?(\/[a-zA-Zа-яА-Я\d\-._~!$&'()*+,;=:@%/]*)?(\?[a-zA-Zа-яА-Я\d\-._~!$&'()*+,;=:@%/?]*)?(#[a-zA-Zа-яА-Я\d\-._~!$&'()*+,;=:@%/?]*)?$/i,
                    "alertText": "* Невалиден URL"
                },
                "onlyNumberSp": {
                    "regex": /^[0-9\ ]+$/,
                    "alertText": "* Само числа"
                },
                "onlyLetterSp": {
                    "regex": /^([а-яА-Яa-zA-Z\ \'])+$/,
                    "alertText": "* Само букви"
                },
                "onlyLetterAccentSp":{
                    "regex": /^[a-zA-Zа-яА-Я\u00C0-\u017F\ ]+$/i,
                    "alertText": "* Само букви (разрешени са акценти)"
                },
                "onlyLetterNumber": {
                    //"regex": /^[0-9a-zA-Z]+$/,
                    "regex": /^[0-9a-zA-Z\ \n]+$/,
                    "alertText": "* Специални символи не са позволени"
                },
                // Започване на потребителска валидация
                // 1) Име, Фамилия
                "onlyLetter_specialcharacter": 
                {
                    "regex": /^([a-zA-Zа-яА-Я\ ])+$/,
                    //(разрешени латински или кирилски букви) "regex": /^([^\u0000-\u007F]|[a-zA-Zа-яА-Я\ \_\,\`\.\'\^\-])+$/,                     
                    "alertText": "* Само букви и символи ' _,`.'^-' са позволени"
                },
                // 2) Град, Щат, Държава
                "city_state_country_validation": 
                {
                    "regex": /^([a-zA-Zа-яА-Я\_\\,\`\.\'\^\-\&])+$/,
                    "alertText": "* Само букви и символи ' _,`.'^-&' са позволени"
                },
                // 3) Категория на PopUp, Име на лекарство, Име на събитие
                "popup_category_validation": 
                {
                    "regex": /^[0-9a-zA-Zа-яА-Я\ \_\,\`\.\:\[\]\'\^\()]+$/,
                    "alertText": "* Само букви, числа и символи ' _,`.'^' са позволени"
                },
                // 4) Адрес и Описание
                "address_description_validation": 
                {
                    "regex": /^[0-9a-zA-Zа-яА-Я\ \?\_\,\`\.\:\[\]\'\^\-\&\n]+$/,
                    "alertText": "* Само букви, числа и символи ' _,`.'^-&' са позволени"
                },
                "vailidation_with_question_mark": 
                {
                    "regex": /^[0-9a-zA-Zа-яА-Я\ \?\_\,\`\.\:\[\]\'\^\-\&\n]+$/,
                    "alertText": "* Само букви, числа и символи ' _,`.'^-&?' са позволени"
                },
                "description_validation":
                {
                    "regex": /^[0-9a-zA-Zа-яА-Я\ \_\!\@\(\)\,\`\.\:\[\]\'\^\-\&\n]+$/,
                    "alertText": "* Само букви, числа и символи ' _,`.'^-&'@!() са позволени"
                },
                // 5) Потребителско име
                "username_validation": 
                {
                    "regex": /^[0-9a-zA-Zа-яА-Я\_\.\-\@]+$/,
                    "alertText": "* Само букви, числа и символи '_.-@' са позволени"
                }, 
                // 6) Телефонен номер
                "phone_number": 
                {
                    "regex": /^[0-9\ \-\+]+$/,
                    "alertText": "* Само числа и символи ' -+' са позволени"
                }, 
                // 7) За пощенски код
                "zipcode": 
                {
                    "regex": /^[0-9a-zA-Zа-яА-Я\ \-\+]+$/,
                    "alertText": "* Само числа и символи ' -+' са позволени"
                }, 
                // Край на потребителската валидация
                // --- ПОЛИЧЕНИ ПРАВИЛА -- Това са специфични за демонстрациите, могат да бъдат премахнати или променени според вашите нужди
                "ajaxUserCall": {
                    "url": "ajaxValidateFieldUser",
                    // може да искате да предадете допълнителни данни в AJAX заявката
                    "extraData": "name=eric",
                    "alertText": "* Този потребител - потребителското име вече е регистрирано",
                    "alertTextLoad": "* Валидация, моля изчакайте"
                },
                "ajaxUserCallPhp": {
                    "url": "phpajax/ajaxValidateFieldUser.php",
                    // може да искате да предадете допълнителни данни в AJAX заявката
                    "extraData": "name=eric",
                    // ако предоставите "alertTextOk", ще се покаже като зелено съобщение при успешно валидиране
                    "alertTextOk": "* Това потребителско име е достъпно",
                    "alertText": "* Този потребител е вече зает",
                    "alertTextLoad": "* Валидация, моля изчакайте"
                },
                "ajaxNameCall": {
                    // местоположение на отдалечения JSON услуга
                    "url": "ajaxValidateFieldName",
                    // грешка
                    "alertText": "* Това потребителско име вече е регистрирано",
                    // ако предоставите "alertTextOk", ще се покаже като зелено съобщение при успешно валидиране
                    "alertTextOk": "* Това име е достъпно",
                    // говори само за себе си
                    "alertTextLoad": "* Валидация, моля изчакайте"
                },
                "ajaxNameCallPhp": {
                    // местоположение на отдалечения JSON услуга
                    "url": "phpajax/ajaxValidateFieldName.php",
                    // грешка
                    "alertText": "* Това потребителско име вече е регистрирано",
                    // говори само за себе си
                    "alertTextLoad": "* Валидация, моля изчакайте"
                },
                "validate2fields": {
                    "alertText": "* Моля, въведете HELLO"
                },
                //tls предупреждение: домашно разработено не е полагано
                "dateFormat":{
                    "regex": /^\d{4}[\/\-](0?[1-9]|1[012])[\/\-](0?[1-9]|[12][0-9]|3[01])$|^(?:(?:(?:0?[13578]|1[02])(\/|-)31)|(?:(?:0?[1,3-9]|1[0-2])(\/|-)(?:29|30)))(\/|-)(?:[1-9]\d\d\d|\d[1-9]\d\d|\d\d[1-9]\d|\d\d\d[1-9])$|^(?:(?:0?[1-9]|1[0-2])(\/|-)(?:0?[1-9]|1\d|2[0-8]))(\/|-)(?:[1-9]\d\d\d|\d[1-9]\d\d|\d\d[1-9]\d|\d\d\d[1-9])$|^(0?2(\/|-)29)(\/|-)(?:(?:0[48]00|[13579][26]00|[2468][048]00)|(?:\d\d)?(?:0[48]|[2468][048]|[13579][26]))$/,
                    "alertText": "* Невалидна дата"
                },
                //tls предупреждение: домашно разработено не е полагано
                "dateTimeFormat": {
                    "regex": /^\d{4}[\/\-](0?[1-9]|1[012])[\/\-](0?[1-9]|[12][0-9]|3[01])\s+(1[012]|0?[1-9]){1}:(0?[1-5]|[0-6][0-9]){1}:(0?[0-6]|[0-6][0-9]){1}\s+(am|pm|AM|PM){1}$|^(?:(?:(?:0?[13578]|1[02])(\/|-)31)|(?:(?:0?[1,3-9]|1[0-2])(\/|-)(?:29|30)))(\/|-)(?:[1-9]\d\d\d|\d[1-9]\d\d|\d\d[1-9]\d|\d\d\d[1-9])$|^((1[012]|0?[1-9]){1}\/(0?[1-9]|[12][0-9]|3[01]){1}\/\d{2,4}\s+(1[012]|0?[1-9]){1}:(0?[1-5]|[0-6][0-9]){1}:(0?[0-6]|[0-6][0-9]){1}\s+(am|pm|AM|PM){1})$/,
                    "alertText": "* Невалидна дата или формат на дата",
                    "alertText2": "Очакван формат: ",
                    "alertText3": "дд/мм/гггг чч:мм:сс AM|PM или ", 
                    "alertText4": "гггг-мм-дд чч:мм:сс AM|PM"
                }
            };
        }
    };

    $.validationEngineLanguage.newLang();
    
})(jQuery);
